app/Controllers/Login.php

SELECT *
FROM `user`
WHERE `username` = 'annas'
 LIMIT 1
---
    public function process()
    {
        // Validasi input
        $validation = \Config\Services::validation();
        $rules = [
            'username' => 'required',
            'password' => 'required'
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()
                ->withInput()
                ->with('validation', $this->validator);
        }

        // Ambil data dari form
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Cari user di database
        $user = $this->userModel->where('username', $username)->first();